In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text

In [2]:
import getpass
password = getpass.getpass()

# Activity 1

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [ ]:
query = '''ALTER TABLE sakila.staff
DROP COLUMN picture;'''
pd.read_sql_query(query, engine)

In [ ]:
# 1. Drop column picture from staff.
query = '''ALTER TABLE sakila.staff
DROP COLUMN picture;'''
pd.read_sql_query(query, engine)

In [5]:
# 2. A new person is hired to help Jon. Her name is TAMMY SANDERS, and she is a customer. Update the database accordingly.
query = '''SELECT * FROM sakila.customer where first_name = 'TAMMY' and last_name = 'SANDERS';'''
pd.read_sql_query(query, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,75,2,TAMMY,SANDERS,TAMMY.SANDERS@sakilacustomer.org,79,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [6]:
# now I know the customer_id is 79 and her details 
query = '''SELECT * FROM staff WHERE first_name LIKE 'Jon';'''
pd.read_sql_query(query, engine)

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update
0,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [ ]:
# now I know the store_id is 2 where Jon and Tammy will be working together
query = '''INSERT INTO staff(staff_id, first_name, last_name, address_id, email, store_id, active, username, password, last_update)
VALUES
(3,'Tammy','Sanders', 79, 'Tammy.Sanders@sakilastaff.com', 2, 1, 'Tammy', null, '2023-04-10 14:08:00');'''
pd.read_sql_query(query, engine)

In [7]:
# check if she was added correctly
query = '''SELECT * FROM sakila.staff;'''
pd.read_sql_query(query, engine)

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16
2,3,Tammy,Sanders,79,Tammy.Sanders@sakilastaff.com,2,1,Tammy,None,2023-04-10 14:08:00

In [8]:
# 3 Add rental for movie "Academy Dinosaur" by Charlotte Hunter from Mike Hillyer at Store 1. 
# You can use current date for the rental_date column in the rental table. 
# Hint: Check the columns in the table rental and see what information you would need to add there. 
# You can query those pieces of information. For eg., you would notice that you need customer_id information as well. 
# To get that you can use the following query:

query = '''select customer_id from sakila.customer
where first_name = 'CHARLOTTE' and last_name = 'HUNTER';'''
pd.read_sql_query(query, engine)

   customer_id
0          130

In [9]:
# Customer ID is 130

query = '''SELECT first_name, last_name, staff_id, store_id from staff
where store_id = 1;'''
pd.read_sql_query(query, engine)

  first_name last_name  staff_id  store_id
0       Mike   Hillyer         1         1

In [11]:
# Mike has staff_id = 1

query = '''SELECT * FROM rental;'''
df = pd.read_sql_query(query, engine)
df.tail()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [12]:
# I see that I need to add the following columns: rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update
# I can also see that the last rental_id is 16049, so I can use 16050 for my new rental

query = '''SELECT title, film_id from film
WHERE title='Academy Dinosaur';'''
pd.read_sql_query(query, engine)

              title  film_id
0  ACADEMY DINOSAUR        1

In [13]:
# "Academy Dinosaur" has film_id = 1

query = '''SELECT film_id, inventory_id, store_id from inventory
WHERE film_id = 1 and store_id = 1;'''
pd.read_sql_query(query, engine)

   film_id  inventory_id  store_id
0        1             1         1
1        1             2         1
2        1             3         1
3        1             4         1

In [15]:
# "Academy Dinosaur" has inventory_id = 1, 2; 3 & 4

query = '''SELECT DISTINCT inventory_id, rental_date, return_date from sakila.rental
WHERE inventory_id BETWEEN 1 and 4;'''
pd.read_sql_query(query, engine)

    inventory_id         rental_date         return_date
0              1 2005-07-08 19:03:15 2005-07-11 21:29:15
1              1 2005-08-02 20:13:10 2005-08-11 21:35:10
2              1 2005-08-21 21:27:43 2005-08-30 22:26:43
3              2 2005-05-30 20:21:07 2005-06-06 00:36:07
4              2 2005-06-17 20:24:00 2005-06-23 17:45:00
5              2 2005-07-07 10:41:31 2005-07-11 06:25:31
6              2 2005-07-30 22:02:34 2005-08-06 02:09:34
7              2 2005-08-23 01:01:01 2005-08-30 20:08:01
8              3 2005-07-31 21:36:07 2005-08-03 23:59:07
9              3 2005-08-22 23:56:37 2005-08-25 18:58:37
10             4 2005-08-02 00:47:19 2005-08-03 00:02:19
11             4 2005-08-21 18:32:42 2005-08-23 21:09:42

In [ ]:
# Everything has been returned so I can use any of the inventory_id's

In [ ]:
# Now add the new rental with info gathered 
query = '''INSERT INTO rental(rental_id, rental_date, inventory_id, customer_id, return_date, staff_id)
VALUES
(16050, '2023-04-10 14:08:00', 1, 130, null, 1);'''
pd.read_sql_query(query, engine)

In [17]:
# -- check if she was added correctly
query = '''SELECT * from rental
where rental_id = 16050;'''
pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,16050,2023-04-10 13:11:38,1,130,None,1,2023-04-10 13:11:38

# Activity 2

In [19]:
# 1. Use dbdiagram.io to propose a new structure for the Sakila database.
from IPython.display import Image
Image(url='https://camo.githubusercontent.com/94c7105d3e2fdde2318c3eed4d45ccca11bdc064f38402f9a2bba22951286bd9/68747470733a2f2f656475636174696f6e2d7465616d2d323032302e73332d65752d776573742d312e616d617a6f6e6177732e636f6d2f646174612d616e616c79746963732f64617461626173652d73616b696c612d736368656d612e706e67')

In [ ]:
# Hint: in Workbench, fetch the schema by: Menu > database > reverse engineer > continue > continue > mark checkbox on sakila > continue > continue > execute > continue > close

In [ ]:
# 2. Define primary keys and foreign keys for the new database.
from IPython.display import Image
Image(url='https://jpg')